#
# Created by 
#   realTimeFpga.exe  on Thu Apr  7 16:22:46 2022
# (c) Xilinx, Inc.
#
set_units -time ns -capacitance pf
# define clock adc_pll/clk_out1
create_generated_clock -source [get_pins {i_1/adc7961_timing\/cycle_cnt_reg[4]/C}] -edges {1 2 3} -edge_shift {0.000000 -0.500000 -1.000000} -name adc_pll\/clk_out1 [get_pins adc_pll/bbstub_clk_out1/O]
# define clock u_ddr3_256_32/ui_clk
create_clock -period 10.000000 -waveform {0.000000 5.000000} -name u_ddr3_256_32\/ui_clk [get_pins u_ddr3_256_32/bbstub_ui_clk/O]
# define clock okUH0
create_clock -period 9.920000 -waveform {0.000000 4.960000} -name okUH0 [get_ports {okUH[0]}]
# define clock sys_clk
create_clock -period 5.000000 -waveform {0.000000 2.500000} -name sys_clk [get_ports sys_clkp]
# define clock mmcm0_clkfb
create_generated_clock -source [get_pins okHI\/mmcm0/CLKIN1] -master_clock okUH0 -multiply_by 1 -name mmcm0_clkfb [get_pins okHI\/mmcm0/CLKFBOUT] -add
# define clock mmcm0_clk0
create_generated_clock -source [get_pins okHI\/mmcm0/CLKIN1] -master_clock okUH0 -edges {1 2 3} -edge_shift {1.488000 1.488000 1.488000} -name mmcm0_clk0 [get_pins okHI\/mmcm0/CLKOUT0] -add
# define clock ad7960_gen[0].adc7961/sclk_s
create_clock -period 4.000000 -waveform {0.000000 2.000000} -name ad7960_gen[0].adc7961\/sclk_s [get_ports {a_dco_p[0]}]
# define clock ad7960_gen[1].adc7961/sclk_s
create_clock -period 4.000000 -waveform {0.000000 2.000000} -name ad7960_gen[1].adc7961\/sclk_s [get_ports {a_dco_p[1]}]
# define clock ad7960_gen[2].adc7961/sclk_s
create_clock -period 4.000000 -waveform {0.000000 2.000000} -name ad7960_gen[2].adc7961\/sclk_s [get_ports {a_dco_p[2]}]
# define clock ad7960_gen[3].adc7961/sclk_s
create_clock -period 4.000000 -waveform {0.000000 2.000000} -name ad7960_gen[3].adc7961\/sclk_s [get_ports {a_dco_p[3]}]
# define clock constraints adc_pll/clk_out1
# define clock constraints u_ddr3_256_32/ui_clk
# define clock constraints okUH0
# define clock constraints sys_clk
# define clock constraints mmcm0_clkfb
# define clock constraints mmcm0_clk0
# define clock constraints ad7960_gen[0].adc7961/sclk_s
# define clock constraints ad7960_gen[1].adc7961/sclk_s
# define clock constraints ad7960_gen[2].adc7961/sclk_s
# define clock constraints ad7960_gen[3].adc7961/sclk_s
# exception 0
set_multicycle_path -setup -from [list [get_ports {okUH[0]}] [get_ports {okUH[1]}] [get_ports {okUH[2]}] [get_ports {okUH[3]}] [get_ports {okUH[4]}]] 2
# exception 1
set_multicycle_path -setup -from [list [get_ports {okUHU[0]}] [get_ports {okUHU[1]}] [get_ports {okUHU[2]}] [get_ports {okUHU[3]}] [get_ports {okUHU[4]}] [get_ports {okUHU[5]}] [get_ports {okUHU[6]}] [get_ports {okUHU[7]}] [get_ports {okUHU[8]}] [get_ports {okUHU[9]}] [get_ports {okUHU[10]}] [get_ports {okUHU[11]}] [get_ports {okUHU[12]}] [get_ports {okUHU[13]}] [get_ports {okUHU[14]}] [get_ports {okUHU[15]}] [get_ports {okUHU[16]}] [get_ports {okUHU[17]}] [get_ports {okUHU[18]}] [get_ports {okUHU[19]}] [get_ports {okUHU[20]}] [get_ports {okUHU[21]}] [get_ports {okUHU[22]}] [get_ports {okUHU[23]}] [get_ports {okUHU[24]}] [get_ports {okUHU[25]}] [get_ports {okUHU[26]}] [get_ports {okUHU[27]}] [get_ports {okUHU[28]}] [get_ports {okUHU[29]}] [get_ports {okUHU[30]}] [get_ports {okUHU[31]}]] 2
# exception 4
set_false_path -through [get_pins okHI\/core0/core0/a0\/l62a5479e7989ce7f4d5507c695cc69cf_reg/Q]  -to [list [get_pins {okHI\/core0/core0/a0\/cb0\/U0\/inst_fifo_gen\/gconvfifo.rf\/grf.rf\/rstblk\/ngwrdrst.grst.g7serrst.gnsckt_wrst.rst_wr_reg2_inst/arststages_ff_reg[1]/D}] [get_pins {okHI\/core0/core0/a0\/cb0\/U0\/inst_fifo_gen\/gconvfifo.rf\/grf.rf\/rstblk\/ngwrdrst.grst.g7serrst.gnsckt_wrst.rst_wr_reg2_inst/arststages_ff_reg[1]/CE}] [get_pins {okHI\/core0/core0/a0\/cb0\/U0\/inst_fifo_gen\/gconvfifo.rf\/grf.rf\/rstblk\/ngwrdrst.grst.g7serrst.gnsckt_wrst.rst_wr_reg2_inst/arststages_ff_reg[0]/D}] [get_pins {okHI\/core0/core0/a0\/cb0\/U0\/inst_fifo_gen\/gconvfifo.rf\/grf.rf\/rstblk\/ngwrdrst.grst.g7serrst.gnsckt_wrst.rst_wr_reg2_inst/arststages_ff_reg[0]/CE}]]
set_input_delay 8 -clock okUH0 -max [get_ports {okUH[4]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUH[3]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUH[2]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUH[1]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUH[0]}]
set_input_delay 10 -clock okUH0 -min [get_ports {okUH[4]}]
set_input_delay 10 -clock okUH0 -min [get_ports {okUH[3]}]
set_input_delay 10 -clock okUH0 -min [get_ports {okUH[2]}]
set_input_delay 10 -clock okUH0 -min [get_ports {okUH[1]}]
set_input_delay 10 -clock okUH0 -min [get_ports {okUH[0]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[31]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[30]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[29]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[28]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[27]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[26]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[25]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[24]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[23]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[22]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[21]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[20]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[19]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[18]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[17]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[16]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[15]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[14]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[13]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[12]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[11]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[10]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[9]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[8]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[7]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[6]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[5]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[4]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[3]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[2]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[1]}]
set_input_delay 8 -clock okUH0 -max [get_ports {okUHU[0]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[31]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[30]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[29]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[28]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[27]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[26]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[25]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[24]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[23]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[22]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[21]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[20]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[19]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[18]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[17]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[16]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[15]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[14]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[13]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[12]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[11]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[10]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[9]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[8]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[7]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[6]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[5]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[4]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[3]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[2]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[1]}]
set_input_delay 2 -clock okUH0 -min [get_ports {okUHU[0]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okHU[2]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okHU[1]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okHU[0]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okHU[2]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okHU[1]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okHU[0]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[31]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[30]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[29]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[28]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[27]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[26]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[25]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[24]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[23]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[22]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[21]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[20]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[19]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[18]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[17]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[16]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[15]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[14]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[13]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[12]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[11]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[10]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[9]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[8]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[7]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[6]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[5]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[4]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[3]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[2]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[1]}]
set_output_delay 2 -clock okUH0 -max [get_ports {okUHU[0]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[31]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[30]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[29]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[28]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[27]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[26]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[25]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[24]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[23]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[22]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[21]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[20]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[19]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[18]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[17]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[16]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[15]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[14]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[13]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[12]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[11]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[10]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[9]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[8]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[7]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[6]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[5]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[4]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[3]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[2]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[1]}]
set_output_delay -0.5 -clock okUH0 -min [get_ports {okUHU[0]}]
set_clock_groups  -asynchronous -group [list  [get_clocks {sys_clk}]] -group  [list  [get_clocks {mmcm0_clk0}] [get_clocks {okUH0}] ]
